capacity-testing.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <stringProp name="TestPlan.comments">Capacity test: Ramps up to 1000 concurrent users over 10 minutes, then runs for 10 minutes total duration (stops after 10 minutes or if error rate &gt; 0.1%, throughput drops below threshold)</stringProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <stringProp name="TestPlan.user_define_classpath">false</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">5000</intProp>
        <intProp name="ThreadGroup.ramp_time">2500</intProp>
        <longProp name="ThreadGroup.duration">2500</longProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">${__P(port,6060)}</stringProp>
          <stringProp name="HTTPSampler.protocol">${__P(proto,http)}</stringProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
        </ConfigTestElement>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request" enabled="true">
          <stringProp name="HTTPSampler.path">/</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <DurationAssertion guiclass="DurationAssertionGui" testclass="DurationAssertion" testname="Duration Assertion" enabled="true">
            <stringProp name="DurationAssertion.duration">1800</stringProp>
          </DurationAssertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Duration Assertion Flag Check" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.atomic.AtomicBoolean;

// Initialize stop flag
if (!props.containsKey(&quot;durationStopRequested&quot;)) {
    synchronized(props) {
        if (!props.containsKey(&quot;durationStopRequested&quot;)) {
            props.put(&quot;durationStopRequested&quot;, new AtomicBoolean(false));
        }
    }
}

AtomicBoolean stopRequested = props.get(&quot;durationStopRequested&quot;);

// Exit early if stop already requested
if (stopRequested.get()) {
    return;
}

// Only process if this sample actually failed
if (!prev.isSuccessful()) {
    String responseMessage = prev.getResponseMessage();
    
    // Check if failure was specifically due to Duration Assertion
    if (responseMessage != null &amp;&amp; responseMessage.contains(&quot;lasted too long&quot;)) {
        // Use compareAndSet to ensure only one thread triggers stop
        if (stopRequested.compareAndSet(false, true)) {
            log.error(&quot;*** DURATION ASSERTION FAILED: Response time exceeded threshold ***&quot;);
            log.error(&quot;*** STOPPING TEST ***&quot;);
            
            try {
                ctx.getEngine().stopTest(true);
            } catch (Exception e) {
                log.error(&quot;Failed to stop test: &quot; + e.getMessage());
            }
        }
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Error Rate Assertion" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.atomic.AtomicLong;
import java.util.concurrent.atomic.AtomicBoolean;
import java.util.concurrent.ConcurrentLinkedQueue;

double maxErrorRate = 1;
long warmupPeriod = 5000; // 5 seconds
int windowSize = 1000;

// Initialize counters
if (!props.containsKey(&quot;errorRateTotal&quot;)) {
    synchronized(props) {
        if (!props.containsKey(&quot;errorRateTotal&quot;)) {
            props.put(&quot;errorRateTotal&quot;, new AtomicLong(0));
            props.put(&quot;errorRateFailed&quot;, new AtomicLong(0));
            props.put(&quot;errorRateStartTime&quot;, new AtomicLong(System.currentTimeMillis()));
            props.put(&quot;errorWindow&quot;, new ConcurrentLinkedQueue());
            props.put(&quot;stopRequested&quot;, new AtomicBoolean(false));
        }
    }
}

AtomicLong totalCount = props.get(&quot;errorRateTotal&quot;);
AtomicLong failedCount = props.get(&quot;errorRateFailed&quot;);
AtomicLong startTime = props.get(&quot;errorRateStartTime&quot;);
ConcurrentLinkedQueue errorWindow = props.get(&quot;errorWindow&quot;);
AtomicBoolean stopRequested = props.get(&quot;stopRequested&quot;);

// If already requested stop, don&apos;t process further
if (stopRequested.get()) {
    return;
}

long total = totalCount.incrementAndGet();
boolean isError = !prev.isSuccessful();

// Add to sliding window
errorWindow.add(isError ? 1 : 0);
while (errorWindow.size() &gt; windowSize) {
    errorWindow.poll();
}

if (isError) {
    failedCount.incrementAndGet();
}

// Check after warmup
long runtime = System.currentTimeMillis() - startTime.get();
if (runtime &gt;= warmupPeriod &amp;&amp; total &gt; 50 &amp;&amp; errorWindow.size() &gt;= 100) {
    // Calculate error rate
    int windowErrors = 0;
    for (Integer val : errorWindow) {
        if (val != null &amp;&amp; val == 1) {
            windowErrors++;
        }
    }
    int windowTotal = errorWindow.size();
    double errorRate = windowTotal &gt; 0 ? (windowErrors / (double) windowTotal) * 100.0 : 0.0;
    
    // Check threshold
    if (errorRate &gt; maxErrorRate) {
        // Use compareAndSet to ensure only one thread triggers the stop
        if (stopRequested.compareAndSet(false, true)) {
            String msg = String.format(&quot;ERROR RATE EXCEEDED: %.3f%% &gt; %.2f%% (%d errors in %d sample window)&quot;, 
                                       errorRate, maxErrorRate, windowErrors, windowTotal);
            log.error(&quot;*** &quot; + msg + &quot; ***&quot;);
            log.error(&quot;*** STOPPING TEST NOW ***&quot;);
            
            try {
                ctx.getEngine().stopTest(true); // ✅ CORRECT METHOD
            } catch (Exception e) {
                log.error(&quot;Failed to stop test: &quot; + e.getMessage());
            }
        }
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
          <JSR223Assertion guiclass="TestBeanGUI" testclass="JSR223Assertion" testname="Throughput Assertion" enabled="true">
            <stringProp name="cacheKey">true</stringProp>
            <stringProp name="script">import java.util.concurrent.atomic.AtomicLong;
import java.util.concurrent.atomic.AtomicBoolean;

double minThroughput = 6000.0; // req/s
long warmupPeriod = 60000; // 1 min warmup
long checkInterval = 60000; // Check every 60 seconds

long currentTime = System.currentTimeMillis();

// Initialize
if (!props.containsKey(&quot;throughputTotal&quot;)) {
    synchronized(props) {
        if (!props.containsKey(&quot;throughputTotal&quot;)) {
            props.put(&quot;throughputTotal&quot;, new AtomicLong(0));
            props.put(&quot;throughputStartTime&quot;, new AtomicLong(currentTime));
            props.put(&quot;lastThroughputCheck&quot;, new AtomicLong(currentTime));
            props.put(&quot;throughputStopRequested&quot;, new AtomicBoolean(false));
            props.put(&quot;samplesAtWarmupEnd&quot;, new AtomicLong(-1)); // Track samples at warmup end
        }
    }
}

AtomicLong totalSamples = props.get(&quot;throughputTotal&quot;);
AtomicLong testStartTime = props.get(&quot;throughputStartTime&quot;);
AtomicLong lastCheck = props.get(&quot;lastThroughputCheck&quot;);
AtomicBoolean stopRequested = props.get(&quot;throughputStopRequested&quot;);
AtomicLong samplesAtWarmupEnd = props.get(&quot;samplesAtWarmupEnd&quot;);

// If already requested stop, don&apos;t process further
if (stopRequested.get()) {
    return;
}

// Increment sample count
long total = totalSamples.incrementAndGet();

// Check threshold only after warmup and at intervals
long testRuntime = currentTime - testStartTime.get();
long timeSinceLastCheck = currentTime - lastCheck.get();

// Mark samples at the end of warmup period
if (testRuntime &gt;= warmupPeriod &amp;&amp; samplesAtWarmupEnd.get() == -1) {
    samplesAtWarmupEnd.compareAndSet(-1, total);
}

if (testRuntime &gt;= warmupPeriod &amp;&amp; timeSinceLastCheck &gt;= checkInterval) {
    // Update last check time
    lastCheck.set(currentTime);
    
    // Calculate throughput ONLY from samples after warmup
    long warmupEndSamples = samplesAtWarmupEnd.get();
    long samplesAfterWarmup = total - warmupEndSamples;
    long effectiveRuntime = testRuntime - warmupPeriod;
    double throughput = (samplesAfterWarmup * 1000.0) / effectiveRuntime;
    
    log.info(String.format(&quot;Current throughput: %.2f req/s (samples after warmup: %d, runtime: %d ms)&quot;, 
                          throughput, samplesAfterWarmup, effectiveRuntime));
    
    if (throughput &lt; minThroughput) {
        // Use compareAndSet to ensure only one thread triggers the stop
        if (stopRequested.compareAndSet(false, true)) {
            String msg = String.format(&quot;THROUGHPUT DEGRADED: %.2f req/s &lt; %.2f req/s (samples: %d)&quot;, 
                                       throughput, minThroughput, samplesAfterWarmup);
            log.error(&quot;*** &quot; + msg + &quot; ***&quot;);
            log.error(&quot;*** STOPPING TEST DUE TO LOW THROUGHPUT ***&quot;);
            prev.setSuccessful(false);
            prev.setResponseMessage(msg);
            
            try {
                ctx.getEngine().stopTest(true);
            } catch (Exception e) {
                log.error(&quot;Failed to stop test: &quot; + e.getMessage());
            }
        }
    }
}</stringProp>
            <stringProp name="scriptLanguage">groovy</stringProp>
          </JSR223Assertion>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>